{
  "articles": [
    {
      "id": "5",
      "title": "How do you check if a webpage is HTML5?",
      "body": "Try it out on Internet Explorer.",
      "author": 2,
      "createdAt": "2020-05-26 03:46:54",
      "updatedAt": "2022-12-21 17:33:05"
    },
    {
      "id": "63a02bf88c8c6e2f3bf8a2ea",
      "title": "Why do JAVA programmers wear glasses?",
      "body": "Because they don't C#",
      "author": 2,
      "createdAt": "2021-07-11 11:51:37",
      "updatedAt": "2022-08-05 09:05:35"
    },
    {
      "id": "63a02bf8ec40d8114a27a6f7",
      "title": "Knock-knock",
      "body": "A race condition. Who is there?",
      "author": 2,
      "createdAt": "2021-09-07 02:02:29",
      "updatedAt": "2022-06-29 01:00:29"
    },
    {
      "id": "63a02bf83fe4524c66eccfc2",
      "title": "A SQL query walks into a bar...",
      "body": "...walks up to two tables and asks...can I join you?",
      "author": 2,
      "createdAt": "2018-01-05 09:16:10",
      "updatedAt": "2022-10-18 07:07:42"
    },
    {
      "id": "63a02bf801901e5165a4e31c",
      "title": "An IPv6 packet is walking out of the house",
      "body": "He goes nowhere",
      "author": 2,
      "createdAt": "2015-02-16 05:46:42",
      "updatedAt": "2022-12-20 20:10:27"
    },
    {
      "id": "63a02bf8885aec2f7312a81d",
      "title": "A UI is like a joke",
      "body": "If you have to explain it then it is not that good",
      "author": 2,
      "createdAt": "2014-12-28 01:13:45",
      "updatedAt": "2022-09-16 12:43:47"
    },
    {
      "id": "63a02bf8c1544165030e26e5",
      "title": "There are 10 types of people in this world...",
      "body": "Those who understand binary and those who don't",
      "author": 1,
      "createdAt": "2021-08-13 01:04:20",
      "updatedAt": "2022-12-21 14:12:16"
    },
    {
      "id": "63a02bf848a23e8104658084",
      "title": "Why did the programmer quit his job?",
      "body": "Because he didn't get arrays.",
      "author": 1,
      "createdAt": "2022-10-16 04:13:13",
      "updatedAt": "2022-12-21 14:12:47"
    },
    {
      "id": "63a02bf82d072f9878a251fb",
      "title": "What did the router say to the doctor?",
      "body": "It hurts when IP.",
      "author": 2,
      "createdAt": "2018-02-24 10:28:59",
      "updatedAt": "2022-12-21 14:13:44"
    },
    {
      "id": "63a02bf8fa22a151d445652b",
      "title": "I was gonna tell you a joke about UDP...",
      "body": "...but you might not get it.",
      "author": 1,
      "createdAt": "2017-06-30 03:28:05",
      "updatedAt": "2022-12-21 14:16:04"
    },
    {
      "id": "63a02bf83838a0c04abf7f6c",
      "title": "Programming is like sex...",
      "body": "One mistake and you have to support it for the rest of your life.",
      "author": 1,
      "createdAt": "2022-09-01 05:43:13",
      "updatedAt": "2022-12-21 14:21:34"
    },
    {
      "id": "63a02bf8ffdde8251c66ba9b",
      "title": "A man is smoking a cigarette and blowing smoke rings into the air.",
      "body": "His girlfriend becomes irritated with the smoke and says, “Can’t you see the warning on the cigarette pack?  Smoking is hazardous to your health!”\n\nTo which the man replies, “I am a programmer.  We don’t worry about warnings; we only worry about errors.”",
      "author": 1,
      "createdAt": "2014-05-17 02:05:20",
      "updatedAt": "2022-12-21 14:22:32"
    },
    {
      "id": "63a02bf86a6491d4bb9c9a54",
      "title": "['hip', 'hip']",
      "body": "(hip hip array)",
      "author": 1,
      "createdAt": "2017-04-11 09:47:47",
      "updatedAt": "2022-12-21 14:17:12"
    },
    {
      "id": "63a02bf8e8a29478e556bdda",
      "title": "How many programmers does it take to change a lightbulb?",
      "body": "None that's a hardware problem",
      "author": 2,
      "createdAt": "2019-10-18 05:09:37",
      "updatedAt": "2022-12-21 14:17:53"
    },
    {
      "id": "63a02bf879af56f6e30baf38",
      "title": "Why do C# and Java developers keep breaking their keyboards?",
      "body": "Because they use a strongly typed language.",
      "author": 1,
      "createdAt": "2015-02-23 10:04:51",
      "updatedAt": "2022-12-21 14:18:57"
    },
    {
      "id": "63a02bf8498f1b3791293614",
      "title": "How did the programmer die in the shower?",
      "body": "He read the shampoo bottle instructions: Lather. Rinse. Repeat.",
      "author": 1,
      "createdAt": "2014-01-17 01:34:22",
      "updatedAt": "2022-12-21 14:20:37"
    },
    {
      "id": "63a02bf8d2dad1431c0543fa",
      "title": "A computer science student is studying",
      "body": "A computer science student is studying under a tree and another pulls up on a flashy new bike.  The first student asks, “Where’d you get that?”\n\nThe student on the bike replies, “While I was studying outside, a beautiful girl pulled up on her bike.  She took off all her clothes and said, ‘You can have anything you want’.”\n\nThe first student responds, “Good choice!  Her clothes probably wouldn’t have fit you.”",
      "author": 1,
      "createdAt": "2014-05-02 10:25:03",
      "updatedAt": "2022-12-21 14:24:57"
    },
    {
      "id": "63a02bf82212c8ab08158022",
      "title": "Laws of Computer Programming",
      "body": "1. Any given program, when running, is obsolete.\n\n2. Any given program costs more and takes longer.\n\n3. If a program is useful, it will have to be changed.\n\n4. If a program is useless, it will have to be documented.\n\n5. Any program will expand to fill available memory.\n\n6. The value of a program is proportional to the weight of its output.\n\n7. Program complexity grows until it exceeds the capabilities of the programmer who must maintain it.\n\n8. Any non-trivial program contains at least one bug.\n\n9. Undetectable errors are infinite in variety, in contrast to detectable errors, which by definition are limited.\n\n10. Adding manpower to a late software project makes it later.",
      "author": 1,
      "createdAt": "2016-08-06 03:09:56",
      "updatedAt": "2022-12-21 14:29:15"
    },
    {
      "title": "Why computers are like men",
      "body": "1. In order to get their attention, you have to turn them on.\n2. They have a lot of data, but are still clueless.\n3. They are supposed to help you solve problems, but half the time they are the problem.\n4. As soon as you commit to one, you realize that if you had waited a little longer, you could have had a better model.",
      "author": 1,
      "createdAt": "2022-12-21 14:47:19",
      "id": "GNHbo2v",
      "updatedAt": "2022-12-21 14:51:03"
    },
    {
      "title": "Why computers are like women",
      "body": "1. No one but the Creator understands their internal logic.\n2. The native language they use to communicate with other computers is incomprehensible to everyone else.\n3. Even your smallest mistakes are stored in long-term memory for later retrieval.\n4. As soon as you make a commitment to one, you find yourself spending half your paycheck on accessories for it.",
      "author": 2,
      "createdAt": "2022-12-21 14:52:10",
      "id": "4C_RJ4O"
    },
    {
      "title": "A programmer finds himself in front of a committee",
      "body": "A programmer finds himself in front of a committee that decides whether he should go to Heaven or Hell.  The committee tells the programmer he has a say in the matter and asks him if he wants to see either Heaven or Hell before stating his preference.\n\n“Sure,” the programmer replies.  “I have a pretty good idea what Heaven is like, so let’s see Hell.”  So an angel takes the programmer to a sunny beach, full of beautiful women in skimpy bikinis playing volleyball, listening to music and having a great time.  “Wow!” he exclaims, “Hell looks great!  I’ll take Hell!”\n\nInstantly the programmer finds himself in red-hot lava with demons tearing at his flesh.  “Where’s the beach?  The music?  The women?” he screams frantically to the angel.\n\n“That was the demo,” the angel replies as she vanishes.\n\n",
      "author": 1,
      "createdAt": "2022-12-21 14:52:53",
      "id": "5xby6v5"
    },
    {
      "title": "Jesus and Satan have an argument ",
      "body": "Jesus and Satan have an argument as to who is the better programmer.  This goes on for a few hours until they come to an agreement to hold a contest with God as the judge.  They set themselves before their computers and begin.  They type furiously, lines of code streaming up the screen, for several hours straight.\n\nSeconds before the end of the competition, a bolt of lightning strikes, taking out the electricity.  Moments later, the power is restored, and God announces that the contest is over.  He asks Satan to show his work.  Visibly upset, Satan cries and says, “I have nothing.  I lost it all when the power went out.”\n\n“Very well,” says God, “let us see if Jesus has fared any better.”\n\nJesus presses a key, and the screen comes to life in vivid display, the voices of an angelic choir pour forth from the speakers.\n\nSatan is astonished.  He stutters, “B-b-but how?!  I lost everything, yet Jesus’ program is intact!  How did he do it?”\n\nGod chuckles, “Everybody knows… Jesus saves.”",
      "author": 2,
      "createdAt": "2022-12-21 14:53:26",
      "id": "Ntv-eAw"
    },
    {
      "title": "Software Development Cycles",
      "body": "1. Programmer produces code he believes is bug-free.\n2. Product is tested. 20 bugs are found.\n3. Programmer fixes 10 of the bugs and explains to the testing department that the other 10 aren’t really bugs.\n4. Testing department finds that five of the fixes didn’t work and discovers 15 new bugs.\n5. Repeat three times steps 3 and 4.\n6. Due to marketing pressure and an extremely premature product announcement based on overly-optimistic programming schedule, the product is released.\n7. Users find 137 new bugs.\n8. Original programmer, having cashed his royalty check, is nowhere to be found.\n9. Newly-assembled programming team fixes almost all of the 137 bugs, but introduce 456 new ones.\n10. Original programmer sends underpaid testing department a postcard from Fiji. Entire testing department quits.\n11. Company is bought in a hostile takeover by competitor using profits from their latest release, which had 783 bugs.\n12. New CEO is brought in by board of directors. He hires a programmer to redo program from scratch.\n13. Programmer produces code he believes is bug-free…",
      "author": 1,
      "createdAt": "2022-12-21 14:56:23",
      "id": "RABp5XQ"
    }
  ],
  "authors": [
    {
      "id": 1,
      "name": "Mindaugas",
      "createdAt": "2022-12-13 11:53:49",
      "updatedAt": "2022-12-14 16:00:20"
    },
    {
      "id": 2,
      "name": "Domas",
      "createdAt": "2022-12-13 15:53:49",
      "updatedAt": "2022-12-14 12:00:20"
    }
  ]
}